# 惯用导入

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# Pandas & Numpy 区别

#####  #01
##### Numpy : 更像列表， index 从 0 开始， 没有没有数值标签
##### Pandas ： 更像是字典形式， Pandas 是基于 Numpy 构建的， 可以为每行每列定义 keys
##### ...

##### #02
##### Pandas 是围绕 Series 和 DataFrame 两个核心数据结构展开的
##### Series 和 DataFrame 分别对应与一维序列和二维表结构
##### ...
##### Series 一维数组，与 Numpy 中的一维 array 类似，二者都与 Python 基本的数据结构 List 相似
##### 区别是：List 中的元素可以是不同的数据类型，而 Array / Series 中只允许存储相同的数据类型，这个可以更高效的使用内存，提高运算效率!

# Basic Date Struct

## Series

In [2]:
pd.Series([1, 2, 3.0, 'abc', np.nan])

0      1
1      2
2      3
3    abc
4    NaN
dtype: object

## DataFrame
##### 可以将 DataFrame 看成是共享同一个 index 的 Series 的集合

In [3]:
pd.DataFrame({
    'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo'
})

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# Create Data

## Series - Create Series by passing a list

In [4]:
pd.Series([1, 3, 5, 7])

0    1
1    3
2    5
3    7
dtype: int64

In [5]:
pd.Series(data=[1, 3, 5, 7], index=['a', 'b', 'x', 'y'])

a    1
b    3
x    5
y    7
dtype: int64

## DataFrame

### Create By Numpy.Array

In [6]:
# 01
pd.DataFrame(np.arange(12).reshape((3,4)))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
# 02
# np.random.randn 从标准正态分布中返回一个样本，参数 [rows, columns]
dates = pd.date_range('20130101', periods=6)
pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

                   A         B         C         D
2013-01-01  0.689956  0.411860 -0.005026 -2.473095
2013-01-02  0.001530  3.650722  1.041357  0.019177
2013-01-03  1.143497  1.294556  0.402352  1.205717
2013-01-04 -1.114056 -0.128796  0.889256  1.020386
2013-01-05 -0.101884 -0.399351 -0.502718  0.582950
2013-01-06 -0.203590  1.837911 -0.842284  0.657083

### Create By Dict

In [8]:
# 01
pd.DataFrame({
    'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo'
})

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

##### 如果不指定 DataFrame 的 index， 默认为从 0 开始的索引

In [9]:
# 02
data = {
    'state' : ['Ohino','Ohino','Ohino','Nevada','Nevada'],
    'year'  : [2000,2001,2002,2001,2002],
    'pop'   : [1.5,1.7,3.6,2.4,2.9]
}
DataFrame(data)

   pop   state  year
0  1.5   Ohino  2000
1  1.7   Ohino  2001
2  3.6   Ohino  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [10]:
# 03 -赋值时指定索引
DataFrame(
    data,
    index = ['one','two','three','four','five'],
    columns = ['year','state','pop','debt']
)

       year   state  pop debt
one    2000   Ohino  1.5  NaN
two    2001   Ohino  1.7  NaN
three  2002   Ohino  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

# Data Property

## Series

### index / values

In [11]:
s = Series(data=[1, 3, 5, 7], index=['a', 'b', 'x', 'y'])

In [12]:
print('s.index :', s.index)

s.index : Index(['a', 'b', 'x', 'y'], dtype='object')

In [13]:
print('s.values :', s.values)

s.values : [1 3 5 7]

### index.name / name

In [14]:
s.name = 'a_series'
s.index.name = 'the_index'
s

the_index
a    1
b    3
x    5
y    7
Name: a_series, dtype: int64

## DataFrame

In [15]:
df = pd.DataFrame({
    'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo'
})
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### dtpyes / col-type

In [16]:
df.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

##### 任意抽出一列都是 Series 类型

In [17]:
type(df['B'])

pandas.core.series.Series

### index

In [18]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

### columns

In [19]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

### values

In [20]:
df.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

### head( ) / tail( )

In [21]:
df.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [22]:
df.tail(3)

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### describe()

In [23]:
df.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

### T

In [24]:
df.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

# Modify Index

## Series.reindex

In [25]:
ser = Series([4.5, 7.2, -5.3, 3.6], index=['a', 's', 'e', 'g'])
ser

a    4.5
s    7.2
e   -5.3
g    3.6
dtype: float64

In [26]:
# 01
a = ['a', 'b', 's', 'd', 'e']
ser.reindex(a)

a    4.5
b    NaN
s    7.2
d    NaN
e   -5.3
dtype: float64

In [27]:
# 02
ser.reindex(a, fill_value=0)

a    4.5
b    0.0
s    7.2
d    0.0
e   -5.3
dtype: float64

## DataFrame.reindex

In [28]:
# 01
data = {
    'state' : ['Ohino','Ohino','Ohino','Nevada','Nevada'],
    'year'  : [2000,2001,2002,2001,2002],
    'pop'   : [1.5,1.7,3.6,2.4,2.9]
}
df = DataFrame(data)

In [29]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

   pop   state  year
a  1.5   Ohino  2000
b  1.7   Ohino  2001
c  3.6   Ohino  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002

In [30]:
# 02
data = {
    'Texas':[1, 4, 5],
    'California':[2, 5, 8]
}
df = DataFrame(data, index=['a', 'b', 'd'])
df

   California  Texas
a           2      1
b           5      4
d           8      5

In [31]:
state = ['Texas', 'Utha', 'California']
df.reindex(columns=state, index=['a', 'b', 'c', 'd'])

   Texas  Utha  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    NaN   NaN         NaN
d    5.0   NaN         8.0

# Process Data

## SelectData

### selecting a single column 选择单列

In [32]:
dates = pd.date_range('20180324', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

In [33]:
df['a']

2018-03-24     0
2018-03-25     4
2018-03-26     8
2018-03-27    12
2018-03-28    16
2018-03-29    20
Freq: D, Name: a, dtype: int32

In [34]:
df.a

2018-03-24     0
2018-03-25     4
2018-03-26     8
2018-03-27    12
2018-03-28    16
2018-03-29    20
Freq: D, Name: a, dtype: int32

### Slice obj[ : : ]

In [35]:
data= {
    'Ohio':[0, 3, 5],
    'Texas':[1, 4, 7],
    'California':[2, 5, 6],
    'Harbin':[1,2,3]
}
df = DataFrame(data, index=['a','b','c'])
df

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

##### Attention  : 在使用行位置进行切片的时候， ':'  不可省略，否则就是对列操作了

##### Attention  : 使用位置，同 List   /   使用 index，则为闭区间

In [36]:
df[:2]

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4

In [37]:
df[:'c']

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

#### Attention  : 行切片，列索引

##### Attention  : 行切片

In [38]:
df['a':'c']

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

In [39]:
df[0:3]

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

##### Attention  : 列索引

In [40]:
df['California']

a    2
b    5
c    6
Name: California, dtype: int64

In [41]:
df[['Harbin','Texas']]

   Harbin  Texas
a       1      1
b       2      4
c       3      7

In [42]:
df[['Harbin','Texas']][:2]

   Harbin  Texas
a       1      1
b       2      4

### loc : select by label

##### Attention 标签选择 : loc - 通过 '行键 / 列键'

In [43]:
dates = pd.date_range('20180324', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

##### Attention loc - row_key

In [44]:
df.loc['20180326']

a     8
b     9
c    10
d    11
Name: 2018-03-26 00:00:00, dtype: int32

In [45]:
df.loc['20180326':'20180328']

             a   b   c   d
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19

##### Attention loc - columns_key
##### row-‘：’  不能省略

In [46]:
df.loc[:, 'a']

2018-03-24     0
2018-03-25     4
2018-03-26     8
2018-03-27    12
2018-03-28    16
2018-03-29    20
Freq: D, Name: a, dtype: int32

In [47]:
df.loc[:,'a':'d']

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

In [48]:
df.loc[:, ['a', 'c']]

             a   c
2018-03-24   0   2
2018-03-25   4   6
2018-03-26   8  10
2018-03-27  12  14
2018-03-28  16  18
2018-03-29  20  22

### Attention : 关于降维

In [49]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.523032 -1.681652  0.602477  0.137106
2013-01-02 -2.457572  1.224771  1.036245  0.185064
2013-01-03  0.938922  0.677486 -1.246535 -1.558833
2013-01-04 -0.705516  0.467468 -0.772680 -0.834027
2013-01-05  0.693122 -0.014155 -0.977887  1.178518
2013-01-06 -0.084686  0.814818 -1.124116 -1.800173

##### Attention : 选择一行，会降维

In [50]:
t = df.loc['20130102', ['A', 'C']]
print(t)
print(' >> type(t) :', type(t))

A   -2.457572
C    1.036245
Name: 2013-01-02 00:00:00, dtype: float64
 >> type(t) : <class 'pandas.core.series.Series'>

##### Attention : 选择某个具体元素，会降维

In [51]:
t = df.loc['20130102', 'A']
print(t)
print(' >> type(t) :', type(t))

-2.457572196836788
 >> type(t) : <class 'numpy.float64'>

### iloc : select by position

In [52]:
dates = pd.date_range('20180324', periods=6)
df = pd.DataFrame(np.arange(30).reshape((6,5)), index=dates, columns=['a','b','c','d','e'])
df

             a   b   c   d   e
2018-03-24   0   1   2   3   4
2018-03-25   5   6   7   8   9
2018-03-26  10  11  12  13  14
2018-03-27  15  16  17  18  19
2018-03-28  20  21  22  23  24
2018-03-29  25  26  27  28  29

##### Attention : Singnal Value

In [53]:
df.iloc[3,4]

19

##### Attention : Row-index and Row-Slice

In [54]:
df.iloc[3]

a    15
b    16
c    17
d    18
e    19
Name: 2018-03-27 00:00:00, dtype: int32

In [55]:
df.iloc[3:5]

             a   b   c   d   e
2018-03-27  15  16  17  18  19
2018-03-28  20  21  22  23  24

##### Attention : Columns-index and Columns-Slice

In [56]:
df.iloc[:,1]

2018-03-24     1
2018-03-25     6
2018-03-26    11
2018-03-27    16
2018-03-28    21
2018-03-29    26
Freq: D, Name: b, dtype: int32

In [57]:
df.iloc[:, 2:4]

             c   d
2018-03-24   2   3
2018-03-25   7   8
2018-03-26  12  13
2018-03-27  17  18
2018-03-28  22  23
2018-03-29  27  28

##### Attention : Row-Slice and Columns-Slice

In [58]:
df.iloc[3:5, 2:4]

             c   d
2018-03-27  17  18
2018-03-28  22  23

##### Attention : Row-Select

In [59]:
df.iloc[[1,3,5],1:3]

             b   c
2018-03-25   6   7
2018-03-27  16  17
2018-03-29  26  27

##### Attention : Row-Select & Columns-Select

In [60]:
df.iloc[[1,2,4], [0,2]]

             a   c
2018-03-25   5   7
2018-03-26  10  12
2018-03-28  20  22

###  Boolean Indexing

In [61]:
data= {
    'Ohio':[0, 3, 5],
    'Texas':[1, 4, 7],
    'California':[2, 5, 6],
    'Harbin':[1,2,3]
}
df = DataFrame(data, index=['a','b','c'])
df

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

##### Attention : Columns-Boolean

In [62]:
df['Texas']>=4

a    False
b     True
c     True
Name: Texas, dtype: bool

In [63]:
df.Texas >= 4

a    False
b     True
c     True
Name: Texas, dtype: bool

In [64]:
df[df['Texas']>=4]

   California  Harbin  Ohio  Texas
b           5       2     3      4
c           6       3     5      7

##### Attention : Row-Boolean

In [65]:
df.loc['c']>5

California     True
Harbin        False
Ohio          False
Texas          True
Name: c, dtype: bool

##### 使用布尔数组，列切法中 ':' 不能省略

In [66]:
df.loc[ : , df.loc['c']>5]

   California  Texas
a           2      1
b           5      4
c           6      7

##### Attention : isin( )

In [67]:
df

   California  Harbin  Ohio  Texas
a           2       1     0      1
b           5       2     3      4
c           6       3     5      7

In [68]:
df['New'] = ['one', 'three', 'two']
df

   California  Harbin  Ohio  Texas    New
a           2       1     0      1    one
b           5       2     3      4  three
c           6       3     5      7    two

In [69]:
df[df['New'].isin(['two', 'three'])]

   California  Harbin  Ohio  Texas    New
b           5       2     3      4  three
c           6       3     5      7    two

### Select Columns or Rows

In [70]:
dates = pd.date_range('20180324', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

##### Attention : select some columns

In [71]:
df.loc['20180326', ['a', 'c']]

a     8
c    10
Name: 2018-03-26 00:00:00, dtype: int32

In [72]:
df.loc[:, ['a', 'c']]

             a   c
2018-03-24   0   2
2018-03-25   4   6
2018-03-26   8  10
2018-03-27  12  14
2018-03-28  16  18
2018-03-29  20  22

In [73]:
df[['a', 'c']]

             a   c
2018-03-24   0   2
2018-03-25   4   6
2018-03-26   8  10
2018-03-27  12  14
2018-03-28  16  18
2018-03-29  20  22

##### Attention : select some rows

In [74]:
df.loc[[dates[1],dates[4]]]

             a   b   c   d
2018-03-25   4   5   6   7
2018-03-28  16  17  18  19

In [75]:
df.iloc[[1, 4]]

             a   b   c   d
2018-03-25   4   5   6   7
2018-03-28  16  17  18  19

##### Attetion : Select row and columns

In [76]:
df.loc[[dates[1],dates[4]], ['c','b']]

             c   b
2018-03-25   6   5
2018-03-28  18  17

## Add Data

In [77]:
dates = pd.date_range('20180324', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

In [78]:
df['f'] = np.nan
df

             a   b   c   d   f
2018-03-24   0   1   2   3 NaN
2018-03-25   4   5   6   7 NaN
2018-03-26   8   9  10  11 NaN
2018-03-27  12  13  14  15 NaN
2018-03-28  16  17  18  19 NaN
2018-03-29  20  21  22  23 NaN

In [79]:
df['e'] = pd.Series([1,2,3,4,5,6], index=df.index)
df

             a   b   c   d   f  e
2018-03-24   0   1   2   3 NaN  1
2018-03-25   4   5   6   7 NaN  2
2018-03-26   8   9  10  11 NaN  3
2018-03-27  12  13  14  15 NaN  4
2018-03-28  16  17  18  19 NaN  5
2018-03-29  20  21  22  23 NaN  6

## Delete Data

### Series

In [80]:
ser = Series([4.5, 7.2, -5.3, 3], index=['d','b','c','a'])
ser

d    4.5
b    7.2
c   -5.3
a    3.0
dtype: float64

In [81]:
ser.drop('c')

d    4.5
b    7.2
a    3.0
dtype: float64

### DataFrame

In [82]:
data = {
    'ohio':[0, 3, 6],
    'Texa':[1, 4, 7],
    'California':[2,5,8]
}
df = DataFrame(data, index=['a','c','d'])
df

   California  Texa  ohio
a           2     1     0
c           5     4     3
d           8     7     6

##### 默认选取的是行

In [83]:
df.drop('a')

   California  Texa  ohio
c           5     4     3
d           8     7     6

##### 如果要丢掉列，则需要指定轴向 axis=1

In [84]:
df.drop('Texa', axis=1)

   California  ohio
a           2     0
c           5     3
d           8     6

In [85]:
df.drop(['ohio', 'Texa'], axis=1)

   California
a           2
c           5
d           8

## Modify Data

##### Attention : copy( )

In [86]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()
df

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   5   6   7
2018-03-26   8   9  10  11
2018-03-27  12  13  14  15
2018-03-28  16  17  18  19
2018-03-29  20  21  22  23

##### Signal Value

In [87]:
df.loc['20180326','c'] = 1314
df

             a   b     c   d
2018-03-24   0   1     2   3
2018-03-25   4   5     6   7
2018-03-26   8   9  1314  11
2018-03-27  12  13    14  15
2018-03-28  16  17    18  19
2018-03-29  20  21    22  23

In [88]:
df.iloc[1, 2] = 1314
df

             a   b     c   d
2018-03-24   0   1     2   3
2018-03-25   4   5  1314   7
2018-03-26   8   9  1314  11
2018-03-27  12  13    14  15
2018-03-28  16  17    18  19
2018-03-29  20  21    22  23

##### Modify A Columns By np.array

In [89]:
df.loc[:,'d'] = np.array([5] * len(df))
df

             a   b     c  d
2018-03-24   0   1     2  5
2018-03-25   4   5  1314  5
2018-03-26   8   9  1314  5
2018-03-27  12  13    14  5
2018-03-28  16  17    18  5
2018-03-29  20  21    22  5

In [90]:
df.iloc[:,3] = np.array([6] * len(df))
df

             a   b     c  d
2018-03-24   0   1     2  6
2018-03-25   4   5  1314  6
2018-03-26   8   9  1314  6
2018-03-27  12  13    14  6
2018-03-28  16  17    18  6
2018-03-29  20  21    22  6

##### Modify A Columns By Series

In [91]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20180324',periods=6))
df['d'] = s1
df

             a   b     c  d
2018-03-24   0   1     2  1
2018-03-25   4   5  1314  2
2018-03-26   8   9  1314  3
2018-03-27  12  13    14  4
2018-03-28  16  17    18  5
2018-03-29  20  21    22  6

##### Modify select row & columns

In [92]:
df.loc[[dates[1], dates[4]],['b','d']] =[[11111,11111],[2222,2222]]
df

             a      b     c      d
2018-03-24   0      1     2      1
2018-03-25   4  11111  1314  11111
2018-03-26   8      9  1314      3
2018-03-27  12     13    14      4
2018-03-28  16   2222    18   2222
2018-03-29  20     21    22      6

In [93]:
df.iloc[[1,3],[1,3]] = [[12345,12345],[12345,12345]]
df

             a      b     c      d
2018-03-24   0      1     2      1
2018-03-25   4  12345  1314  12345
2018-03-26   8      9  1314      3
2018-03-27  12  12345    14  12345
2018-03-28  16   2222    18   2222
2018-03-29  20     21    22      6

##### Modify By Boolean Indexing

In [94]:
# 修改所有列
df = Ori.copy()
df[df.a>8] = -1234
df

               a     b     c     d
2018-03-24     0     1     2     3
2018-03-25     4     5     6     7
2018-03-26     8     9    10    11
2018-03-27 -1234 -1234 -1234 -1234
2018-03-28 -1234 -1234 -1234 -1234
2018-03-29 -1234 -1234 -1234 -1234

In [95]:
# 仅修改 a 这一列
df = Ori.copy()
df.a[df.a>8] = -1234
df

               a   b   c   d
2018-03-24     0   1   2   3
2018-03-25     4   5   6   7
2018-03-26     8   9  10  11
2018-03-27 -1234  13  14  15
2018-03-28 -1234  17  18  19
2018-03-29 -1234  21  22  23

## Sort Data

##### sort_index(ascending=True) :  对 index 进行排序操作，ascending 参数用于控制升序或降序，默认升序
##### sort_values( ) :  对 values 进行排序操作

### Series

In [96]:
foo = Series(data=[4.5, 7.2, -5.3, 7.2], index=[10, 2, 3, -1])
foo

 10    4.5
 2     7.2
 3    -5.3
-1     7.2
dtype: float64

In [97]:
foo.sort_index()

-1     7.2
 2     7.2
 3    -5.3
 10    4.5
dtype: float64

In [98]:
foo.sort_index(ascending=False)

 10    4.5
 3    -5.3
 2     7.2
-1     7.2
dtype: float64

In [99]:
foo.sort_values()

 3    -5.3
 10    4.5
 2     7.2
-1     7.2
dtype: float64

### DataFrame

In [100]:
df = pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20180324'),
    'C':pd.Series(1, index=list(range(4)), dtype='float32'),
    'D':np.array([3]*4, dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':'foo'
})
df

   A          B    C  D      E    F
0  1 2018-03-24  1.0  3   test  foo
1  1 2018-03-24  1.0  3  train  foo
2  1 2018-03-24  1.0  3   test  foo
3  1 2018-03-24  1.0  3  train  foo

In [101]:
# axis = 1 ==> 对列标签进行排序
df.sort_index(axis=1, ascending=False)

     F      E  D    C          B  A
0  foo   test  3  1.0 2018-03-24  1
1  foo  train  3  1.0 2018-03-24  1
2  foo   test  3  1.0 2018-03-24  1
3  foo  train  3  1.0 2018-03-24  1

In [102]:
# axis = 0 ==> 对行标签进行排序
df.sort_index(axis=0, ascending=False)

   A          B    C  D      E    F
3  1 2018-03-24  1.0  3  train  foo
2  1 2018-03-24  1.0  3   test  foo
1  1 2018-03-24  1.0  3  train  foo
0  1 2018-03-24  1.0  3   test  foo

#### sort_values(by=...)

In [103]:
df['E']=['1','12','-31','0']
df.sort_values(by='E', ascending=False)

   A          B    C  D    E    F
1  1 2018-03-24  1.0  3   12  foo
0  1 2018-03-24  1.0  3    1  foo
3  1 2018-03-24  1.0  3    0  foo
2  1 2018-03-24  1.0  3  -31  foo

## Concat 连接数据

In [104]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.236915  0.902211 -0.163566  0.475387
1 -0.175336 -0.169910  0.294794  0.660029
2  0.370509  0.065604  0.447488  3.154824
3 -0.446243 -0.061000  0.245997 -1.026715
4 -0.354389 -0.161121  0.377392 -2.199895
5 -0.323457  0.947973 -0.148575 -0.025586
6  0.204235  0.565637  0.099780 -2.779762
7  0.349923 -1.103006 -1.195633 -1.159253
8 -1.115630 -0.281839 -2.743796  0.675343
9  1.146208 -1.069695 -0.218570  1.028528

##### 01

In [105]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.236915  0.902211 -0.163566  0.475387
1 -0.175336 -0.169910  0.294794  0.660029
2  0.370509  0.065604  0.447488  3.154824
3 -0.446243 -0.061000  0.245997 -1.026715
4 -0.354389 -0.161121  0.377392 -2.199895
5 -0.323457  0.947973 -0.148575 -0.025586
6  0.204235  0.565637  0.099780 -2.779762
7  0.349923 -1.103006 -1.195633 -1.159253
8 -1.115630 -0.281839 -2.743796  0.675343
9  1.146208 -1.069695 -0.218570  1.028528

##### 02. columns 一样，一般都是上下的合并

In [106]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=['a','b','c','d'])
df3 = pd.DataFrame(np.ones((3,4))*2, columns=['a','b','c','d'])

In [107]:
res = pd.concat([df1, df2, df3], axis=1)
res

     a    b    c    d    a    b    c    d    a    b    c    d
0  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
1  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0

In [108]:
res = pd.concat([df1, df2, df3])
res

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
0  2.0  2.0  2.0  2.0
1  2.0  2.0  2.0  2.0
2  2.0  2.0  2.0  2.0

### ignore_index=True，   重置索引顺序

In [109]:
res = pd.concat([df1, df2, df3], ignore_index=True)
res

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0
7  2.0  2.0  2.0  2.0
8  2.0  2.0  2.0  2.0

### join : 'inner' / 'outer'
##### >  inner : 会把一部分数据裁剪掉，只取相同的部分

In [110]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'],     index=[1,2,3])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=[    'b','c','d','e'], index=[2,3,4])
print(df1, df2, sep='\n\n')

     a    b    c    d
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

     b    c    d    e
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [111]:
res = pd.concat([df1, df2])  # 默认 join = 'outer'
res

     a    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
3  0.0  0.0  0.0  0.0  NaN
2  NaN  1.0  1.0  1.0  1.0
3  NaN  1.0  1.0  1.0  1.0
4  NaN  1.0  1.0  1.0  1.0

In [112]:
res = pd.concat([df1, df2], join='inner')
res

     b    c    d
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [113]:
res = pd.concat([df1, df2], join='inner', ignore_index=True)
res

     b    c    d
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0
5  1.0  1.0  1.0

### join_axes - 按照哪个索引进行合并

In [114]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'],     index=[1,2,3])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=[    'b','c','d','e'], index=[2,3,4])
print(df1, df2, sep='\n\n')

     a    b    c    d
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

     b    c    d    e
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

##### axis=1  :   左右合并

In [115]:
res = pd.concat([df1,df2], axis=1, join_axes=[df1.index])
res

     a    b    c    d    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0

In [116]:
res = pd.concat([df1,df2], axis=1)
res

     a    b    c    d    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
4  NaN  NaN  NaN  NaN  1.0  1.0  1.0  1.0

## Merge

##### 01. on - 基于哪个 columns 进行合并

In [117]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
print(left, right, sep='\n\n')

   key  lval
0  foo     1
1  foo     2

   key  rval
0  foo     4
1  foo     5

In [118]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

##### 02

In [119]:
left = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})
right = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
})
print(left, right, sep='\n\n')

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [120]:
res = pd.merge(left, right, on='key')
res

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

##### 03. consider two keys
###### 依据key1与key2 columns进行合并，并打印出四种结果['left', 'right', 'outer', 'inner']

In [121]:
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [122]:
res = pd.merge(left, right, on=['key1', 'key2'], how='inner')
res

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [123]:
res = pd.merge(left, right, on=['key1', 'key2'], how='outer')
res

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [124]:
res = pd.merge(left, right, on=['key1', 'key2'], how='left')
res

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [125]:
res = pd.merge(left, right, on=['key1', 'key2'], how='right')
res

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

### indicator ： 会将合并的记录放在新的一列

In [126]:
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,2],'col_right':[2,2,2]})
print(df1, df2, sep='\n\n')

   col1 col_left
0     0        a
1     1        b

   col1  col_right
0     1          2
1     2          2
2     2          2

In [127]:
# 依据col1进行合并，并启用indicator=True，最后打印出
res = pd.merge(df1, df2, on='col1', how='outer', indicator=True)  # outer 没有的数据项进行填充
res
# _merge：显示出合并的形式

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

## append / 添加

##### 01

In [128]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.434234 -0.052143 -0.227973 -0.771761
1  0.893222 -1.045227 -0.422076 -1.082180
2  0.553070  0.448177 -0.354671 -0.647742
3  0.778632  0.091775  0.901464  0.116074
4 -0.640330 -1.311265 -0.013488  1.705888
5 -0.005175 -1.002391  0.127682 -0.345025
6  0.620520 -0.512887 -0.976318 -0.618604
7  0.976282  0.285621  0.765313  0.063124

In [129]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.434234 -0.052143 -0.227973 -0.771761
1  0.893222 -1.045227 -0.422076 -1.082180
2  0.553070  0.448177 -0.354671 -0.647742
3  0.778632  0.091775  0.901464  0.116074
4 -0.640330 -1.311265 -0.013488  1.705888
5 -0.005175 -1.002391  0.127682 -0.345025
6  0.620520 -0.512887 -0.976318 -0.618604
7  0.976282  0.285621  0.765313  0.063124
8  0.778632  0.091775  0.901464  0.116074

##### 02

In [130]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=['a','b','c','d'])
res = df1.append(df2, ignore_index=True)
res

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0

In [131]:
df3 = pd.DataFrame(np.ones((3,4))*1, columns=[    'b','c','d','e'], index=[2,3,4])
res = df1.append([df2, df3])
res

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
0  1.0  1.0  1.0  1.0  NaN
1  1.0  1.0  1.0  1.0  NaN
2  1.0  1.0  1.0  1.0  NaN
2  NaN  1.0  1.0  1.0  1.0
3  NaN  1.0  1.0  1.0  1.0
4  NaN  1.0  1.0  1.0  1.0

## Missing Data : dropna, fillna, isnull, notnull

In [132]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan
df

             a     b     c   d
2018-03-24   0   NaN   2.0   3
2018-03-25   4   5.0   NaN   7
2018-03-26   8   9.0  10.0  11
2018-03-27  12  13.0  14.0  15
2018-03-28  16  17.0  18.0  19
2018-03-29  20  21.0  22.0  23

### dropna - 丢弃丢失数据
##### > how  -  [ any:只要存在 NaN 就丢掉，  all:必须全部是 NaN 才能丢掉]
##### > axis - [1 - columns  0 - rows]

In [133]:
df1 = df.copy()

In [134]:
df1.dropna(axis=0, how='any')

             a     b     c   d
2018-03-26   8   9.0  10.0  11
2018-03-27  12  13.0  14.0  15
2018-03-28  16  17.0  18.0  19
2018-03-29  20  21.0  22.0  23

In [135]:
df1.dropna(axis=1, how='any')

             a   d
2018-03-24   0   3
2018-03-25   4   7
2018-03-26   8  11
2018-03-27  12  15
2018-03-28  16  19
2018-03-29  20  23

### fillna - 填充丢失数据

In [136]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan
df

             a     b     c   d
2018-03-24   0   NaN   2.0   3
2018-03-25   4   5.0   NaN   7
2018-03-26   8   9.0  10.0  11
2018-03-27  12  13.0  14.0  15
2018-03-28  16  17.0  18.0  19
2018-03-29  20  21.0  22.0  23

In [137]:
df.fillna(value=1314)

             a       b       c   d
2018-03-24   0  1314.0     2.0   3
2018-03-25   4     5.0  1314.0   7
2018-03-26   8     9.0    10.0  11
2018-03-27  12    13.0    14.0  15
2018-03-28  16    17.0    18.0  19
2018-03-29  20    21.0    22.0  23

### isnull - 检查是否存在缺失数据

In [138]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan
df

             a     b     c   d
2018-03-24   0   NaN   2.0   3
2018-03-25   4   5.0   NaN   7
2018-03-26   8   9.0  10.0  11
2018-03-27  12  13.0  14.0  15
2018-03-28  16  17.0  18.0  19
2018-03-29  20  21.0  22.0  23

In [139]:
df.isnull()

                a      b      c      d
2018-03-24  False   True  False  False
2018-03-25  False  False   True  False
2018-03-26  False  False  False  False
2018-03-27  False  False  False  False
2018-03-28  False  False  False  False
2018-03-29  False  False  False  False

##### Attention : 检查大量数据中是否存在丢失数据

In [140]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan
df

             a     b     c   d
2018-03-24   0   NaN   2.0   3
2018-03-25   4   5.0   NaN   7
2018-03-26   8   9.0  10.0  11
2018-03-27  12  13.0  14.0  15
2018-03-28  16  17.0  18.0  19
2018-03-29  20  21.0  22.0  23

In [141]:
print(np.any(df.isnull()) == True)

True

## GroupBy / 分组

In [142]:
df = pd.DataFrame({
    'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
    'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
    'C' : np.random.randn(8),
    'D' : np.random.randn(8)
})
df

     A      B         C         D
0  foo    one  0.990023  0.061983
1  bar    one -0.420088 -0.315265
2  foo    two -0.640236  0.487178
3  bar  three -1.980216  0.111545
4  foo    two  0.215046  1.359615
5  bar    two  0.350760 -0.279889
6  foo    one  0.603575 -1.562984
7  foo  three  1.236581 -1.750656

##### 分组， 然后应用函数， 统计总和

In [143]:
df.groupby('A').sum()

            C         D
A
bar -2.049544 -0.483608
foo  2.404990 -1.404864

##### 按多列进行分组， 层次索引

In [144]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.420088 -0.315265
    three -1.980216  0.111545
    two    0.350760 -0.279889
foo one    1.593599 -1.501001
    three  1.236581 -1.750656
    two   -0.425190  1.846793

## 重塑

In [145]:
zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']])

In [146]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.054197  0.028855
      two     1.043290 -0.391273
baz   one     0.862354 -1.223631
      two    -0.140817  2.736813

In [147]:
stacked = df2.stack()
stacked

first  second
bar    one     A    1.054197
               B    0.028855
       two     A    1.043290
               B   -0.391273
baz    one     A    0.862354
               B   -1.223631
       two     A   -0.140817
               B    2.736813
dtype: float64

In [148]:
stacked.unstack()

                     A         B
first second
bar   one     1.054197  0.028855
      two     1.043290 -0.391273
baz   one     0.862354 -1.223631
      two    -0.140817  2.736813

In [149]:
stacked.unstack(1)

second        one       two
first
bar   A  1.054197  1.043290
      B  0.028855 -0.391273
baz   A  0.862354 -0.140817
      B -1.223631  2.736813

In [150]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.054197  0.862354
       B  0.028855 -1.223631
two    A  1.043290 -0.140817
       B -0.391273  2.736813

# [Ex/Im]port Data

In [151]:
data = pd.read_csv('student.csv')
data

    Student ID   name  age  gender
0         1100  Kelly   22  Female
1         1101    Clo   21  Female
2         1102   Tily   22  Female
3         1103   Tony   24    Male
4         1104  David   20    Male
5         1105  Catty   22    Male
6         1106      M    3  Female
7         1107      N   43  Female
8         1108      A   13    Male
9         1109      S   12    Male
10        1110  David   33    Male
11        1111     Dw    3  Female
12        1112      Q   23    Male

In [152]:
data.to_pickle('student.pickle')


# Apply Funciton

In [153]:
data= {
    'Ohio':[0, 3, 5],
    'Texas':[1, 4, 7],
    'California|':[2, 5, 6]
}
df = DataFrame(data, index=['a','b','c'])
df

   California|  Ohio  Texas
a            2     0      1
b            5     3      4
c            6     5      7

## lambda

In [154]:
func = lambda x : x.max() - x.min()

In [155]:
df.apply(func)

California|    4
Ohio           5
Texas          6
dtype: int64

In [156]:
df.apply(func, axis = 1)

a    2
b    2
c    2
dtype: int64

## Other Function

In [157]:
dates = pd.date_range('20180324', periods=6)
Ori = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['a','b','c','d'])
df = Ori.copy()

In [158]:
df.apply(np.cumsum)

             a   b   c   d
2018-03-24   0   1   2   3
2018-03-25   4   6   8  10
2018-03-26  12  15  18  21
2018-03-27  24  28  32  36
2018-03-28  40  45  50  55
2018-03-29  60  66  72  78

# 透视图 / Pivot Table

In [159]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.236924 -0.604255
1     one  B  foo -0.161553 -0.360597
2     two  C  foo -0.659463  0.561728
3   three  A  bar  0.690477 -0.672156
4     one  B  bar -0.517127 -0.360353
5     one  C  bar -0.253934 -0.053961
6     two  A  foo -0.017022 -0.712298
7   three  B  foo  0.618937  0.387683
8     one  C  foo -0.368502  0.099957
9     one  A  bar -0.871671 -1.383038
10    two  B  bar -1.106270 -1.074436
11  three  C  bar -0.933985  0.885084

In [160]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.871671 -0.236924
      B -0.517127 -0.161553
      C -0.253934 -0.368502
three A  0.690477       NaN
      B       NaN  0.618937
      C -0.933985       NaN
two   A       NaN -0.017022
      B -1.106270       NaN
      C       NaN -0.659463